const fs = require('fs');
const carbone = require('carbone');

  var data = {
	date1 : {
		a1 : '___',
		a2 : '26',
		a3 : '03',
		a4 : '1'
	},
	person : {
		info : 'Иванов Денис Семенович 22.06.1987',
		pass : 'ТП УФМС России по УР',
		date : '14.06.2012',
		inn : '123456789012',
		bik : '043999999',
		rs : '40817810024325532124',
		ks : '30101810200234535355'
	},
	nalog : {
		info : 'Межрайонаая инспекция федеральной налоговой службы №111 по УР',
		adress : 'Россия, УР, г. Ижевск, ул. Пушкинская д.38',
		number : '88888888888',
		mail : 'user@domain.com'
	},
	claims : {
		a1 : 'генератора документа по шаблону',
		a2 : 'Список заявок на разработку ПО',
		a3 : 'Форма ввода заявки на разработку ПО',
		a4 : 'Генератор договора возмездного оказания услуг по шаблону',
		a5 : 'Генератор акта сдачи-приемки оказанных услуг по шаблону',
	},
	date2 : {
		a1 : '11',
		a2 : '02',
		a3 : '1'
	},
	date3 : {
		a1 : '13',
		a2 : '03',
		a3 : '1'
	},
	sum : {
		a1 : '10639',
		a2 : 'десять тысяч шестьсот тридцать девять рублей',
		a3 : '00'
	},
	time : {
		a1 : '30',
		a2 : 'тридцати'
	},
	customermail : 'devpartners@bystrobank.ru',
	time2 : {
		a1 : '3',
		a2 : 'три'
	},
	date4 : {
		a1 : '__',
		a2 : '__',
		a3 : '__',
		a4 : '_'
	},
	date5 : {
		a1 : '__',
		a2 : '__',
		a3 : '_'
	},
	date6 : {
		a1 : '11',
		a2 : 'февраля',
		a3 : '1'
	},
	date7 : {
		a1 : '___',
		a2 : '__',
		a3 : '__',
		a4 : '_'
	},
	date8 : {
		a1 : '__',
		a2 : '_________',
		a3 : '_'
	},
	date9 : {
		a1 : '__',
		a2 : '____________',
		a3 : '_'
	},
	services : {
		a1 : 'реализация сервиса хранения данных',
		a2 : 'реализация сервиса добавления данных',
		a3 : '__________________________________________________'
	},
	sum2 : {
		a1 : '________',
		a2 : '_____________________________________________',
		a3 : '00'
	}
  };

  carbone.render('./Test1.odt', data, function(err, result){
    if (err) {
      return console.log(err);
    }
	
    fs.writeFileSync('result.odt', result);
  });
